src/Openfoam/AeroSUV_unitCube_case/system/blockMeshDict
FoamFile {
    version 2.0;
    format ascii;
    class dictionary;
    object blockMeshDict;
}

scale 1.0;

vertices (
    (-5.5 -5.5 -0.5)
    (10.5 -5.5 -0.5)
    (10.5 5.5 -0.5)
    (-5.5 5.5 -0.5)
    (-5.5 -5.5 5.5)
    (10.5 -5.5 5.5)
    (10.5 5.5 5.5)
    (-5.5 5.5 5.5)
);

blocks (
    hex (0 1 2 3 4 5 6 7) (320 220 120) simpleGrading (1 1 1)
);

edges ();

boundary (
    inlet  { type patch; faces ((0 4 7 3)); }
    outlet { type patch; faces ((1 2 6 5)); }
    bottom { type wall; faces ((0 1 5 4)); }
    top    { type symmetryPlane; faces ((3 2 6 7)); }
    front  { type symmetryPlane; faces ((0 1 2 3)); }
    back   { type symmetryPlane; faces ((4 5 6 7)); }
);

mergePatchPairs ();
