src/Openfoam/AeroSUV_unitCube_case/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version: 2312                                   |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile {
    version 2.0;
    format ascii;
    class dictionary;
    object surfaceFeaturesDict;
}


surfaceFeatureExtractDict
{
    extractionMethod extractFromSurface;
    includedAngle 150;
    writeObj yes;


    surfaces
    (
        {
            surface 17_wheels-front.stl;
            regions ();
        }
    );
}
